[
  {
    "name": "Astha Maurya",
    "email_id": "asthamaurya2014@gmail.com",
    "phone_number": "+91 6284847623/8354009660",
    "location": "Bangalore",
    "objective": "Detail-oriented Software Testing Engineer / Quality Assurance Engineer with 3+ years of hands-on experience in Automation Testing, Manual Testing, API Testing, and Defect Management. Proficient in delivering high-quality software products through Agile methodology, seeking to contribute to dynamic teams by enhancing product quality, optimizing test processes, and implementing efficient test automation strategies.",
    "skills": [
      "Functional, Regression & Integration Testing",
      "Test Automation (Playwright with JavaScript)",
      "Manual Testing & Test Case Design",
      "API Testing (Postman)",
      "SQL & Database Testing",
      "Defect Lifecycle & Bug Tracking (JIRA)",
      "Test Management, Execution & Reporting",
      "Continuous Integration / Continuous Deployment (Jenkins)",
      "Cross-browser and Cross-platform Testing",
      "Agile & Scrum Methodologies",
      "UAT, Smoke, and Regression Testing"
    ],
    "qualifications_summary": "MBA in Information Technology from Subharthi University, Meerut",
    "experience_summary": "5 years in software testing. At KocharTech Pvt. Ltd., developed and maintained automation frameworks using Playwright with JavaScript, achieving 70% test automation coverage. Designed, implemented, and executed comprehensive functional, regression, integration, and end-to-end test cases across web and mobile applications. Performed API Testing and backend validation using Postman and integrated automated API tests within CI/CD pipelines. Executed cross-browser and cross-platform compatibility testing to ensure consistent user experiences. Collaborated closely with developers, product managers, and business analysts during sprint planning and daily stand-ups to ensure clear requirement understanding. Integrated automated test suites with Jenkins for continuous testing and quicker feedback cycles. Managed defect reporting, tracking, and resolution processes through JIRA, ensuring timely issue identification and closure. Improved test case execution efficiency by 20% by refining testing processes and identifying redundant steps. Mentored and trained junior QA engineers on testing best practices, automation tools, and defect management. Maintained comprehensive test documentation including test plans, test cases, execution reports, and defect logs.",
    "has_photo": true,
    "id": "Resume_Astha_Maurya",
    "_original_filename": "Resume_Astha_Maurya.pdf"
  },
  {
    "name": "Chirag Gautam",
    "email_id": "chiraggautam441@gmail.com",
    "phone_number": "8447338942",
    "location": "Ghaziabad",
    "objective": null,
    "skills": [
      "Core JAVA",
      "HTML Basics",
      "Exception Handling",
      "Debugging",
      "Api Testing",
      "Postman",
      "Testing Essentials",
      "Test Case Design",
      "Defect Life Cycle",
      "Manual Testing",
      "Selenium",
      "Cucumber",
      "Page Object Model"
    ],
    "qualifications_summary": "Bachelor Of Computer Applications (BCA) from Institute of Management Studies, Noida (July 2018 – April 2021)",
    "experience_summary": "Software Test Engineer with 3 years of experience. Worked at Coincred (July 2023 – Dec 2024), Oxentic Technologies (January 2022 – July 2023). Projects include Coincred Pro, Multi-Vendor System, Inventory Management System, and Booking and Reservations. Collaborated on requirement review meetings, ensured quality and consistency across different environments, and participated in debugging issues and verifying fixes.",
    "has_photo": true,
    "id": "Chirag_gautam",
    "_original_filename": "Chirag_gautam.pdf"
  },
  {
    "name": "Sikha Srivastava",
    "email_id": "sikhasrivastava1998@gmail.com",
    "phone_number": "+91-9919460903",
    "location": "Mohali, India",
    "objective": "Detail-oriented & motivated tester with a good foundation in software testing. Proficient in test case creation, execution, and defect tracking.",
    "skills": [
      "Selenium",
      "Jira",
      "Trello",
      "Core Java"
    ],
    "qualifications_summary": "M.Sc. from Veer Bahadur Singh Purvanchal University, Jaunpur (2022) with 61%, B.Sc. from Veer Bahadur Singh Purvanchal University, Jaunpur (2018) with 60%, Intermediate from Uttar Pradesh Board, Allahabad (2015) with 78%, High School from Uttar Pradesh Board, Allahabad (2013) with 81%",
    "experience_summary": "5 years in software testing. At Cepoch Software Innovation Private Limited (November 2024 – present), junior QA, proficient in testing mobile applications on both iOS and Android platforms, ensuring compatibility and performance across devices. At 5Bix IT Solution, Mohali (February 2024 – October 2024), Software Testing Engineer, experienced in the preparation of test plans and execution of test cases. At Zorang Technologies, Gurugram (December 2023 – February 2024) QA Intern, performed manual testing on IOS/Android based applications and ContentHubGPT.",
    "has_photo": false,
    "id": "SIKHA SRIVASTAVA  JAN 2025",
    "_original_filename": "SIKHA SRIVASTAVA  JAN 2025.pdf"
  },
  {
    "name": "Dheeraj Sharma",
    "email_id": "dheerajsharmahzb18@gmail.com",
    "phone_number": "+91 970 925 9740",
    "location": "Noida, Uttar Pradesh",
    "objective": "Skilled QA Automation Engineer with 3 years of experience in manual and automation testing.",
    "skills": [
      "Core Java",
      "Selenium",
      "TestNG",
      "Maven",
      "AutoIT",
      "Postman",
      "RestAssured",
      "JMeter",
      "Git"
    ],
    "qualifications_summary": "B.Tech in Electronics and Communication Engineering from GITA, Bhubaneswar (Sept 2017 - Aug 2021) with a GPA of 7.84.",
    "experience_summary": "3 years of experience in Manual and Automation Testing for web and API applications at Virsoftech Pvt Ltd. Developed automation test scripts using Selenium WebDriver (Java) and TestNG, conducted API Testing using Postman and RestAssured, performed Performance Testing with JMeter for up to 50,000 users. Successfully reduced test execution time by 30% by implementing efficient automation scripts, identified and resolved critical performance bottlenecks, improving application response time by 40%. Awarded Best QA Engineer for outstanding contributions to test automation and defect reduction.",
    "has_photo": false,
    "id": "ResumeDheerajSharma",
    "_original_filename": "ResumeDheerajSharma.pdf"
  },
  {
    "name": "Ankit Singh",
    "email_id": "ankitsingh628712@gmail.com",
    "phone_number": null,
    "location": "Ghaziabad",
    "objective": null,
    "skills": [
      "Manual and Automation Testing",
      "Selenium WebDriver",
      "Selenium Test Cases",
      "Core Java",
      "Jira",
      "Agile",
      "Jenkins",
      "Functional and Compatibility Testing",
      "Page Object Modelling",
      "System Integration",
      "Mobile Testing",
      "Postman",
      "Blackbox Testing",
      "TestNG framework",
      "Data Driven Framework",
      "Soap API",
      "Rest API",
      "API Testing",
      "Github",
      "Database Testing",
      "Regression Testing",
      "Rest Assured Framework",
      "Web Service Testing",
      "End To End Testing"
    ],
    "qualifications_summary": "B.Tech - Computer Science from Abes Engineering College, Ghaziabad in 2023 secured 70%, Diploma - Computer Science & Engineering from Galgotias University, Dankaur in 2020 secured 86%, 12th - CBSE, New Lancers Convent Sikandrabad UP in 2018, 10th - CBSE, Divine Educational Institute Sikandrabad UP in 2016",
    "experience_summary": "Software Test Engineer with overall 2+ years of experience in Manual and Automation Testing. Proficient in Automating Web Application Testing via Selenium WebDriver and experienced in API Testing and Database Testing. Implemented SDLC & STLC concepts. Good exposure to each of the phases of Software Testing Life Cycle (STLC). Experience in Component Testing, Integration testing, End-to-End testing and Regression Testing. Coordinated with the Development team for bug fixing. Tested the Application by carrying out Smoke Testing and Ad-hoc testing. Also worked on Hospital Management System and Employee Leave Management System projects.",
    "has_photo": true,
    "id": "ResumeAnkitSingh",
    "_original_filename": "ResumeAnkitSingh.pdf"
  },
  {
    "name": "Amandeep Singh",
    "email_id": "a m a n d e e p s i n g h 1 3 3 7 @ g m a i l . c o m",
    "phone_number": "9811478184",
    "location": "New Delhi, India",
    "objective": null,
    "skills": [
      "Java",
      "Python",
      "SQL",
      "C++",
      "UNIX",
      "DevOps",
      "DBMS",
      "API Testing",
      "Selenium",
      "TestNG",
      "Jupyter Notebook",
      "PyTorch",
      "Manual Testing",
      "MS Excel",
      "MATLAB",
      "HFSS",
      "PCB Design",
      "Antenna Design"
    ],
    "qualifications_summary": "Bachelor's of Technology in Electronics and Communication Engineering from Amity University, Noida (2018-2022) and online certificate in Python and Machine Learning.",
    "experience_summary": "5 years of experience in software development. At Infosys LTD, Hyderabad, contributed to the development, design, and quality assurance of Google Android Pixel Phones, Wear OS watches, and various Google web Applications. Expertise includes functional and mobile testing (Android and iOS), Wear OS testing, and web application testing. Designed and executed a comprehensive testing framework integrated with automated test scripts, resulting in a 10-20% improvement in test coverage and enhanced product reliability.",
    "has_photo": false,
    "id": "ResumeAmandeepSingh",
    "_original_filename": "ResumeAmandeepSingh.pdf"
  },
  {
    "name": "Ankit Yadav",
    "email_id": "ay473224@gmail.com",
    "phone_number": "6386127953",
    "location": "Greater Noida, UP",
    "objective": null,
    "skills": [
      "Functional",
      "Regression",
      "Sanity",
      "Smoke",
      "UI",
      "Usability",
      "Compatibility",
      "Selenium WebDriver",
      "Maven",
      "Java",
      "Postman",
      "JMeter (Basic)",
      "JIRA",
      "MySQL",
      "SQL Queries"
    ],
    "qualifications_summary": "B.Tech in Computer Science and Engineering from Dr.A.P.J Abdul Kalam Technical University, Greater Noida(UP) (Aug 2018 - July 2022)",
    "experience_summary": "Software Test Engineer with 2+ years of hands-on experience. Designed and executed automated test scripts using Selenium WebDriver with Java. Collaborated with cross-functional Agile teams in sprint planning and defect triage meetings. Performed REST API testing with Postman, validating responses and status codes. Executed MySQL queries for backend validation and data integrity. Logged, tracked, and closed defects using JIRA with detailed replication steps. Conducted regression, sanity, and smoke testing for multiple deployments. Ensured test coverage and optimized test execution across browsers and platforms.",
    "has_photo": true,
    "id": "Ankit_Yadav_Automation(QA)",
    "_original_filename": "Ankit_Yadav_Automation(QA).pdf"
  },
  {
    "name": "Varunagarwal",
    "email_id": "avarun612@gmail.com",
    "phone_number": "8808766591",
    "location": null,
    "objective": "Detail-oriented and results-driven Manual/Automation Tester with 2.9 years of experience software quality assurance.",
    "skills": [
      "Manual Testing",
      "Automation Testing",
      "Selenium",
      "API Testing with Postman",
      "TestNG",
      "Java",
      "Eclipse",
      "Agile Methodology",
      "Functional Testing",
      "Git",
      "Mobile App Testing (Android/IOS)",
      "Team management"
    ],
    "qualifications_summary": "B.Tech from ABES Engineering College, Ghazizbad (2018-2022)",
    "experience_summary": "5 years in software quality assurance. At Cognizant Technology Solutions (07/2022-Present), created detailed test cases and test plans based on project requirements. Performed system-wide testing to ensure software quality and accuracy. Maintained clear communication between QA, development, and project management teams to promote teamwork and high-quality results. Implemented automated testing using tools like Selenium Web Driver to improve testing speed and coverage.",
    "has_photo": false,
    "id": "Varun_Agarwall_Apr",
    "_original_filename": "Varun_Agarwall_Apr.pdf"
  },
  {
    "name": "Anirudh Rangari",
    "email_id": "rangarianirudh@gmail.com",
    "phone_number": "7558593131",
    "location": "Bangalore",
    "objective": "Dedicated and results-driven Customer Support Representative with 3+ years of experience in the banking sector, delivering exceptional service and support to customers.",
    "skills": [
      "Rest API Automation",
      "Selenium",
      "Maven",
      "Manual API Testing using Postman",
      "MongoDB",
      "Elastic Search",
      "Test Planning and Execution",
      "Regression Testing",
      "Defect Tracking and Reporting",
      "Cross-functional Collaboration",
      "Java",
      "Javascript",
      "SQL",
      "Cucumber",
      "Playwright"
    ],
    "qualifications_summary": "Bachelor of Engineering (Electrical Engineering) from SHREE RAMCHANDRA COLLEGE OF ENGINEERING (2014-2018), Diploma in Electronics & Telecommunication from BT POLYTECHNIC (2011-2014).",
    "experience_summary": "5+ years of experience in software testing. At Primetrace Technology, worked as QA Engineer from 27th Jan 2025 to 25th April 2025, analyzing business requirements and designing comprehensive test cases. At 56 AI TECHNOLOGIES PRIVATE LIMITED, served as Quality Analyst from 18th July 2022 to 30th Nov 2024, leading testing cycles, developing automated scripts, and managing defect logging. At FLEXI SAFE TECHNOLOGIES INDIA PVT. LTD., worked as Software Test Engineer from 21st Dec 2020 to 13th July 2022, conducting extensive manual testing of online banking platforms and internal financial systems.",
    "has_photo": false,
    "id": "Anirudh_QA_CV_new",
    "_original_filename": "Anirudh_QA_CV_new.pdf"
  },
  {
    "name": "Mahesh Swami",
    "email_id": "maheshswami7864@gmail.com",
    "phone_number": "+91 9373543416",
    "location": null,
    "objective": "Results-driven QA test engineer with over 2.5 years of experience specializing in automation testing, functional testing, manual testing, and implementing automation frameworks.",
    "skills": [
      "Java",
      "SQL",
      "Selenium WebDriver",
      "TestNG",
      "Postman",
      "Rest Assured",
      "Window 11",
      "UNIX",
      "Git",
      "Eclipse",
      "Jenkins",
      "JIRA",
      "Cucumber",
      "API Automation"
    ],
    "qualifications_summary": "MSC: Software Engineering from SRTM University, India (July 2023 – May 2025) and B.Sc. in Computer Science from unknown university (Not Found)",
    "experience_summary": "QA Test Engineer at Quiesta Technology Pvt Ltd (Dec 2022 - Present). Developed automation frameworks using Selenium WebDriver with Java programming, conducted API testing using Postman, integrated automated tests into CI/CD pipelines using Jenkins, and designed a robust UI automation framework using Selenium, Java, TestNG, and Cucumber BDD. Also worked on regression testing, retesting, UI testing, smoke testing, functional testing, and end-to-end application testing.",
    "has_photo": false,
    "id": "Mahesh Swami",
    "_original_filename": "Mahesh Swami.pdf"
  },
  {
    "name": "Abhijeet Deshmukh",
    "email_id": "dabhijeet1997@gmail.com",
    "phone_number": "+91 9226929784",
    "location": null,
    "objective": "To get an opportunity where I can make the best of my potential and contribute to the organizations growth where I can use my knowledge of software testing, technical skills like Manual Testing Using Functional, Non-Functional, Sanity, Smoke, Retesting, Regression, API Testing, Mobile app Testing, Database Testing, OOPS Concept, Automation Testing using Selenium and Java.",
    "skills": [
      "Core Java",
      "Selenium",
      "TestNG",
      "HTML",
      "XML",
      "POM",
      "Postman",
      "Maven"
    ],
    "qualifications_summary": "Bachelor of Engineering from Savitribai Phule University Pune.",
    "experience_summary": "5 years in software testing. Worked as QA Analyst with StackNous Technologies (Nov 2020 to June 2022), Quality Analyst with Trellissoft Engineering Services Pvt. Ltd (Mar 2023 to Aug 2024), and QA Engineer with Pedals Up Innovations LLP (Dec 2024 to April 2025). Involved in designing Test Scenarios and Test Cases, developing Automation scripts for existing and new test cases, performing Functional Testing, Regression Testing and Re-Testing, and documenting Test Cases and Collecting Test Data for Functional Testing.",
    "has_photo": true,
    "id": "Abhijeet_QAResume",
    "_original_filename": "Abhijeet_QAResume.pdf"
  },
  {
    "name": "Abhishak Sharma",
    "email_id": "abhi499152@gmail.com",
    "phone_number": "+91-7988499152",
    "location": "Panchkula",
    "objective": "Software Test Engineer with 4+ years of experience in manual and automation testing for web and mobile applications.",
    "skills": [
      "Selenium WebDriver",
      "TestNG",
      "Postman",
      "Core Java",
      "Agile (Scrum, Kanban)",
      "Functional",
      "Regression",
      "Performance Testing"
    ],
    "qualifications_summary": "Bachelor's Degree in Computer Science from Kurukshetra University (2017) and Automation Testing certification from QSpiders, Bangalore.",
    "experience_summary": "5 years of experience in software testing. At QA Source (Jan 2021 – Present), conducted functional testing for e-commerce modules, performed UI/UX testing across desktop and mobile platforms, executed API testing for payment gateways, created test cases in TCMS, logged defects using Bugzilla, and participated in Agile ceremonies. Also worked on Project: Notion, performing manual and automated testing, developing automated test scripts, executing cross-browser testing, managing test cases in TCMS, collaborating with developers and business teams, and providing regular reports. Interned at Witsy.AI (July 2020 – November 2020), performing functional and regression testing, automating test scenarios using Selenium WebDriver and TestNG, executing API testing using Postman, conducting cross-browser and cross-platform testing, and reporting bugs.",
    "has_photo": false,
    "id": "ResumeAbhishakSharma",
    "_original_filename": "ResumeAbhishakSharma.pdf"
  },
  {
    "name": "Priti Rani",
    "email_id": "preetirajauria15@gmail.com",
    "phone_number": "7217885039",
    "location": "Gurugram, Haryana",
    "objective": null,
    "skills": [
      "Manual Testing",
      "Regression, Smoke, Sanity, Integration, Database",
      "Database Testing",
      "Mysql, Oracle, Mssql",
      "API/WebServices Test",
      "Rest Assured, Postman",
      "Agile methodology",
      "Project Management",
      "Automation Testing",
      "Selenium Web-driver, Selenium Grid, Core Java, TestNG, Extent, Apache POI"
    ],
    "qualifications_summary": "MCA (Computes) Master of Computer Application from Maharishi Dayanand University (2018 – March 2021 | Gurugram, India)",
    "experience_summary": "Over 3.9 years in software testing, encompassing both automation and manual testing. Experience in working with Agile Methodologies. Proficient in preparing Test Plan, Test Strategy & Test Reports along with required artifacts. Professional experience includes roles at PeopleStrong Technologies Pvt. Ltd., Accenture Pvt Ltd, and OptionTown Software PVT. LTD.",
    "has_photo": false,
    "id": "PRITI_RANI_RESUME_QA_AUTOMATION",
    "_original_filename": "PRITI_RANI_RESUME_QA_AUTOMATION.pdf"
  },
  {
    "name": "Varun P",
    "email_id": "varunreddy3460@gmail.com",
    "phone_number": "+91 9398779466",
    "location": null,
    "objective": null,
    "skills": [
      "Automation Testing Tool: Selenium WebDriver",
      "Bug Tracking Tool: Jira",
      "Source Code Tool: GIT",
      "Dependency Management Tool: Maven",
      "Frameworks: Cucumber BDD, TestNG, Junit, Data Driven and POM",
      "Web Services Testing Tool: POSTMAN, Rest Assured"
    ],
    "qualifications_summary": "Bachelors of Engineering from KSRM College Of Engineering, Kadapa (2022-05)",
    "experience_summary": "5 years in software testing. At Banco BPM (2022-07 to 2023-02), performed regression, smoke, and sanity testing using Selenium WebDriver and TestNG framework. At Kijiji (2023-02 to current), analyzed user stories, created test scenarios, developed automation scripts using Selenium WebDriver, Cucumber with BDD framework, and Maven build automation tool. Involved in Agile ceremonies, creating daily/weekly status reports, and performing smoke testing during production releases.",
    "has_photo": false,
    "id": "Varun_Resume",
    "_original_filename": "Varun_Resume.pdf"
  },
  {
    "name": "Harmeet Singh",
    "email_id": "singhharmeet85@gmail.com",
    "phone_number": "+91-9041179181",
    "location": null,
    "objective": "More than 2 Years of industry experience in the area of Software Testing (Manual and Automation) with a solid understanding of Manual Testing, Requirement gathering and analyzing, Test Planning, Test Design, Test Execution and Defect Reporting & Tracking.",
    "skills": [
      "Android Testing",
      "Functional Testing",
      "Manual Testing",
      "Mobile Application Testing",
      "Mobile games"
    ],
    "qualifications_summary": "Bachelor of Technology (B. Tech) in Electrical Engineering from Punjab Technical University (P.T.U) with 71% and Secondary Education (Diploma) in Electrical Engineer the Punjab State Board of Technical Education and Industrial Training, Chandigarh, with 61%",
    "experience_summary": "5 years in software testing. At MoMAGIC Technology Pvt Ltd from July 2023 to March 2025, worked as QA Engineer. At Appable Pvt Ltd from Jan 2017 to Dec 2017, worked as Software Test Engineer. Also, worked at Delta Electronics India Pvt Ltd as Robot Test Engineer from Jan 2018 -Mar 2023. Involved in various projects such as Mchamp, Trivia, Cricgiri, Battle of warriors and ACTITIME, with responsibilities including writing test cases, reviewing test cases, developing and maintaining test data and environments, collaborating with UX designers and developers, and conducting usability testing.",
    "has_photo": false,
    "id": "Harmeet_Singh_QA",
    "_original_filename": "Harmeet_Singh_QA.pdf"
  },
  {
    "name": "Sanjay Gambhir",
    "email_id": "sanjaygambhir74@gmail.com",
    "phone_number": "+91-7206006947",
    "location": null,
    "objective": "To work in a challenging environment that provides generous opportunities for learning, to enhance my working capacities, professional skills & to excel in my field through hard work, skills and perseverance.",
    "skills": [
      "Bug Tracking & Test Management Tools: JIRA",
      "Microsoft Azure Dev-ops and Github Issue Board",
      "Performance Testing: JMeter",
      "API Testing: POSTMAN",
      "Automation Testing: Selenium, Robot Framework, Python",
      "Database: MySQL Workbench",
      "Agile & Scrum Methodologies: Sprint Planning, Test Case Creation, Regression Testing"
    ],
    "qualifications_summary": "B. Tech in Computer Science And Engineering from Kurukshetra University, Maharishi Ved Vyas Engineering College, Jagadhri (Haryana), July 2021 with 70%",
    "experience_summary": "5 years of experience in IT Software testing. In Manual Testing, Mobile testing & Report analysis. Performing projects in V-model and Agile methodology. Gained exposure on end-to-end Functional testing and various testing techniques like Black Box testing, Regression, UI, System and Sanity & Smoke testing. Good understanding of Software testing life cycle and testing concepts. Having good experience on iOS/AndroidApp/WebApp and Expertise in Designing and Developing Test Cases and Execution of Test Cases. Experience in Basic SQL Queries for fetching the data from the database.",
    "has_photo": true,
    "id": "Sanjay Gambhir",
    "_original_filename": "Sanjay Gambhir.pdf"
  },
  {
    "name": "Akash Varun",
    "email_id": "akashvarun492@gmail.com",
    "phone_number": "+91-7985017292",
    "location": "Noida, Uttar Pradesh",
    "objective": null,
    "skills": [
      "Java",
      "Selenium WebDriver",
      "TestNG",
      "POM",
      "Hybrid Framework",
      "Apache Maven",
      "Jira",
      "Agile Methodology"
    ],
    "qualifications_summary": "B. Tech in I.T. from Vishveshwrya Institute of Technology (CGPA - 62.98%) and academic details from UP Board",
    "experience_summary": "3.7 years of experience in Manual/Automation Testing within IT Industry, with expertise in Selenium WebDriver, Automation Frameworks like TestNG, and Agile Methodology. Worked on projects such as InfoFlo CRM and kilimall.com, performing Regression Testing using Selenium Web Driver POM, writing reusable methods using Java, creating hybrid frameworks, and ensuring best coding practices",
    "has_photo": false,
    "id": "ResumeAkashVarun",
    "_original_filename": "ResumeAkashVarun.pdf"
  },
  {
    "name": "Anurag Singh Bisht",
    "email_id": "anuragsinghbisht00@gmail.com",
    "phone_number": "+91-9464022756",
    "location": "Chandigarh, Sector 16-D",
    "objective": "As a QA professional, contribute to all aspects of quality assurance by applying best practices, developing testing solutions, and establishing key metrics.",
    "skills": [
      "Whitebox",
      "Blackbox",
      "Graybox Testing",
      "Google Docs & Sheets",
      "JMeter",
      "Database Testing - Microsoft SQL Server, SQL Server, Mongo DB",
      "Test case & Test plan writing",
      "Api Testing - Postman & Swagger",
      "Entire Browser Stack",
      "JIRA",
      "Azure Devops",
      "Click Up"
    ],
    "qualifications_summary": "B. Tech in Mechanical Engineering from Chandigarh Group of Colleges, Mohali (2016-2019) and Diploma in Electronics & Communication from Guru Nanak Dev Polytechnic College (2013-2016).",
    "experience_summary": "5+ years in software testing. At Mysense Technologies Pvt. Ltd., worked as Software Test Engineer from August 2022 to present, performing database testing using MySQL, Microsoft SQL, MongoDB, and Salesforce, API testing using Postman and Swagger for validating requests and responses, load testing using JMeter, and wrote detailed test plans that were reviewed by the entire team. At Ditstek Innovation Pvt. Ltd., worked as Quality Analyst from June 2021 to July 2022, successfully leading and executing testing for over four projects, supporting teammates to ensure deadlines were consistently met, and performing various types of testing including functional, non-functional, and regression testing on web and mobile apps.",
    "has_photo": false,
    "id": "Anurag Bisht",
    "_original_filename": "Anurag Bisht.pdf"
  },
  {
    "name": "HARSH KAUSHIK",
    "email_id": "kaushikharsh121@gmail.com",
    "phone_number": "+91-28989236365",
    "location": "New Delhi",
    "objective": "Enthusiastic and self-motivated QA Engineer with 1.5 years of experience seeking a job opportunity in a reputable organization that will allow me to expand my knowledge and skills, while contributing to the organization's success and reputation for excellence.",
    "skills": [
      "Core Java",
      "Selenium",
      "Jira",
      "Functional Testing",
      "Regression Testing"
    ],
    "qualifications_summary": "B.Tech (82%) from JIMS ENGINEERING MANAGEMENT TECHNICAL CAMPUS",
    "experience_summary": "1.5 years of experience as a QA Engineer, with expertise in developing and executing automation tests using Java, Cucumber BDD, Serenity framework, and Selenium. Proficient in manual testing, test planning, and test case development. Proven track record in collaborating with development teams to identify and resolve critical bugs. Successfully delivered projects, ensuring smooth operations for clients and improving overall process efficiency.",
    "has_photo": false,
    "id": "Harsh_Kaushik_Updated_Resume",
    "_original_filename": "Harsh_Kaushik_Updated_Resume.pdf"
  },
  {
    "name": "Shivam Kamboj",
    "email_id": "skamboz900@gmail.com",
    "phone_number": "7830002814",
    "location": "Noida, India",
    "objective": null,
    "skills": [
      "Manual",
      "SDLC",
      "STLC",
      "Smoke Testing",
      "Regression",
      "Beta",
      "Functional",
      "Integration",
      "System Testing",
      "Bug Life Cycle",
      "Sanity Testing Alpha",
      "Acceptance Testing",
      "Black Box Testing",
      "Agile Methodology",
      "Scrum Methodology",
      "Sprint Planning Meeting",
      "Scrum Meeting",
      "Lambda Tool",
      "CMS Tool",
      "API Testing",
      "MySQL",
      "Core Java",
      "OOPS Concept",
      "Static & Non-Static",
      "Polymorphism",
      "Method Overloading",
      "Constructor"
    ],
    "qualifications_summary": "B.TECH CSE from Quantum school of technology (2019-Oct-2022 to Feb-2024) and Intermediate, 10th",
    "experience_summary": "Quality Assurance Engineer at Firstcry (BrainBees Solution pvt Ltd). Completed pre-implementation testing for new system modifications to assess potential impacts. Ensured compliance with industry standards by reviewing requirements, specifications, and technical design documents. Communication and coordinate with the developer's team to close the bug within the time. Involved in manual testing, functional testing, regression testing, black box testing, Ul testing. Assisted in the development of new processes to improve module quality and performance. Collaborated with other departments to meet customer requirements. Enhanced production efficiency by implementing improved module assembly techniques. Authored customized user manuals for specific system configurations, tailoring content to unique employee skill profiles. Reduced downtime for maintenance through regular inspection and preventive measures. Properly loaded and unloaded materials in and out of machines. Optimized module operator workflows, resulting in increased overall productivity",
    "has_photo": false,
    "id": "Shivam kamboj56",
    "_original_filename": "Shivam kamboj56.pdf"
  },
  {
    "name": "HRITIK KUMAR BEHERA",
    "email_id": null,
    "phone_number": null,
    "location": "Gurugram, Haryana",
    "objective": null,
    "skills": [
      "Selenium",
      "JavaScript",
      "Playwright",
      "Core Java",
      "SQL"
    ],
    "qualifications_summary": "Bachelor of Technology - Mechanical Engineering from Gandhi Institute of Excellent Technocrats (2016-2021)",
    "experience_summary": "5 years in software testing. At QEdge Technology (Nov 2022-Mar 2023), worked on Agile, developed test scripts using Selenium, and performed functional, regression, integration, and smoke testing. At Coforge (Smart Serve) Limited (March, 2023-Present), Software Test Engineer for SEI Project.",
    "has_photo": true,
    "id": "Hritik Kumar Behera SoftWare Tester 2- years",
    "_original_filename": "Hritik Kumar Behera SoftWare Tester 2- years.pdf"
  },
  {
    "name": "Ankit Yadav",
    "email_id": null,
    "phone_number": null,
    "location": null,
    "objective": "Detail-oriented and result-driven Software Test Engineer with 3 years of hands-on experience in Manual and Automation Testing of web and client-server applications.",
    "skills": [
      "Functional",
      "Regression",
      "Sanity",
      "Smoke",
      "UI",
      "Usability",
      "Compatibility",
      "Selenium WebDriver",
      "Maven",
      "Java",
      "Postman",
      "JMeter",
      "JIRA",
      "MySQL",
      "SQL Queries"
    ],
    "qualifications_summary": "B.Tech in Computer Science and Engineering from Dr.A.P.J Abdul Kalam Technical University, Greater Noida(UP) (Aug 2018 - July 2022)",
    "experience_summary": "Software Test Engineer at Supplivio Private Limited (July 2022 – April 2025). Designed and executed automated test scripts using Selenium WebDriver with Java. Collaborated with cross-functional Agile teams in sprint planning and defect triage meetings. Performed REST API testing with Postman, validating responses and status codes. Executed MySQL queries for backend validation and data integrity. Logged, tracked, and closed defects using JIRA with detailed replication steps. Conducted regression, sanity, and smoke testing for multiple deployments. Ensured test coverage and optimized test execution across browsers and platforms.",
    "has_photo": true,
    "id": "Ankit Yadav _ final",
    "_original_filename": "Ankit Yadav _ final.pdf"
  },
  {
    "name": "Nikita Shende",
    "email_id": "shendenikita1491@gmail.com",
    "phone_number": "7620966533",
    "location": "Nagpur, India",
    "objective": "Experienced Manual QA and Automation QA Tester with 3+ years in ensuring software quality.",
    "skills": [
      "Functional Testing",
      "Regression Testing",
      "Usability Testing",
      "Compatibility Testing",
      "Exploratory Testing",
      "User Acceptance Testing (UAT)",
      "JIRA",
      "Confluence",
      "Postman",
      "API",
      "Selenium & TestNG",
      "SQL",
      "HTML"
    ],
    "qualifications_summary": "Bachelor of Science: Computer Science Engineer from Anjuman College of Engineering and Technology (2019).",
    "experience_summary": "5 years in software testing. At Reva Consultant LLP (02/2024 to Current), executed manual and automation testing for mobile and web applications, developed test plans, and conducted UAT. At Catalyst IT (06/2021 to 11/2023), performed manual testing, identified defects, and participated in UAT.",
    "has_photo": true,
    "id": "ResumeNIKITASHENDE",
    "_original_filename": "ResumeNIKITASHENDE.pdf"
  },
  {
    "name": "Himani Bhatia",
    "email_id": "himani.bhatia31@gmail.com",
    "phone_number": "+8529506979",
    "location": null,
    "objective": "Motivated and results-driven individual seeking a position in Software Testing where I can leverage my expertise in manual and automation testing, along with my teaching experience, to contribute to organizational success.",
    "skills": [
      "Manual Testing",
      "Automation Testing (Selenium)",
      "Programming (Python)",
      "SQL"
    ],
    "qualifications_summary": "M.Com from Kurukshetra University (2019), B.Com from Chaudhary Devi Lal University (2017), and a Software Testing Course from QSpiders.",
    "experience_summary": "Teaching Experience at School: Managed and explained complex topics clearly, honing attention to detail and critical thinking; Developed strong communication, problem-solving, and organizational skills while teaching.",
    "has_photo": false,
    "id": "ResumeHimaniBhatia",
    "_original_filename": "ResumeHimaniBhatia.pdf"
  },
  {
    "name": "Kushank Saini",
    "email_id": "kushanksaini13@gmail.com",
    "phone_number": "+91-8788774341",
    "location": "Gurgaon (HR)",
    "objective": null,
    "skills": [
      "Manual testing",
      "Functional testing",
      "Black box testing",
      "API testing using Postman",
      "Database testing",
      "Automation Selenium with Java",
      "Behavior-driven development (BDD) using Cucumber and Gherkin syntax",
      "Web-application (Fronted and Backend)",
      "Mobile testing (Android or IOS)",
      "Data Base testing using writing SQL queries"
    ],
    "qualifications_summary": "Bachelor of Engineering [B.E] from R.G.P.V University (Bhopal) (2016-2022)",
    "experience_summary": "4.5+ years in Quality Assurance with leading organizations. Experience in software development, manual and automation testing, API testing using Postman, database testing, and experience with Agile Methodologies & Scrum Ceremonies. Worked on various projects including Logistic Application, Blu Smart (Rider App or Symphony Web), PPaaS, HPCL, Grocery E-Commerce, and Apollo Munich Health Insurance.",
    "has_photo": false,
    "id": "kushank_Resume_4",
    "_original_filename": "kushank_Resume_4.5+Testing QA Profile.pdf"
  },
  {
    "name": "Anshika Aggarwal",
    "email_id": "anshika1670@gmail.com",
    "phone_number": "+91-9990774638",
    "location": "Delhi, NCR",
    "objective": "Experienced and meticulous Test Engineer with 4 years of expertise in software testing and quality assurance.",
    "skills": [
      "Java",
      "Selenium WebDriver",
      "Functional Testing",
      "Web Testing",
      "Regression Testing",
      "Jira",
      "Mobile testing",
      "Postman",
      "TestNG"
    ],
    "qualifications_summary": "Mtech (Master of Technology) from Birla Institute of Technology And Science, Pilani (2021-2024), and BCA (Bachelor of Computer Application) from Sirifort Institute of Management Studies (2017-2020).",
    "experience_summary": "5 years in software testing. At Wipro Limited (March 21-April 2025), designed and executed detailed manual and automated test cases to validate core functionality, user interactions, and business flows. Developed automation scripts using Selenium WebDriver with Java to streamline regression and smoke testing processes. Performed thorough functional and web testing, identifying and reporting defects with accuracy and attention to detail. Conducted mobile testing to ensure consistent behavior across devices and operating systems. Created comprehensive test plans, test cases, and test scripts covering both positive and negative scenarios based on requirement specifications. Led User Acceptance Testing (UAT) cycles, validating application readiness against business requirements prior to deployment.",
    "has_photo": false,
    "id": "Anshika_9990774638_",
    "_original_filename": "Anshika_9990774638_.pdf"
  },
  {
    "name": "Nikunj Tyagi",
    "email_id": "Tyaginikunj0101@gmail.com",
    "phone_number": "7042003410",
    "location": "Gurgaon, India 122022",
    "objective": null,
    "skills": [
      "Functional testing",
      "UI/UX testing",
      "Sanity testing",
      "Smoke testing",
      "Regression testing",
      "Linux",
      "SQL",
      "API testing",
      "Integration testing",
      "Test case review",
      "Test planning",
      "Test strategy",
      "UAT",
      "SaaS applications",
      "Mobile App Testing: Native, Hybrid, mWeb, PWA",
      "Dev Tools: mWeb inspect, responsive test Charles Proxy: API/network monitor Emulators: Android Studio, ADB: Install apps, capture logs Build Tools: TestFlight, Firebase, App Center Real Devices: Android/iOS UI & functional test BrowserStack: Cross-browser/device testing (manual & mobile)",
      "Languages/DB: Java, SQL, Cosmos DB Testing Tools: Postman, SOAP UI Test Mgmt: JIRA, ALM, Zephyr Proficient in Automation Testing: (Selenium, TestNG, Maven, Jenkins, Git) Methodologies: Agile, Waterfall"
    ],
    "qualifications_summary": "Bachelor of Science: Electronics and Communication Engineering (ECE) from I.K. Gujral Punjab Technical University (IKGPTU) - Sangrur",
    "experience_summary": "7 years of experience in Quality Assurance, specializing in Functional, API, and Database Testing. Demonstrated track record of leading end-to-end testing for complex applications, ensuring data integrity and seamless functionality across systems. Proficient in developing test cases, executing tests, and validating APIs and databases to ensure high-quality product releases. Skilled in exploratory testing, cloud migration testing (AWS, Azure), and UI/UX validations. Committed to delivering high-quality, defect-free solutions through structured test planning, meticulous execution, and continuous process improvement.",
    "has_photo": false,
    "id": "Nikunj_Tyagi_7YOE_QA",
    "_original_filename": "Nikunj_Tyagi_7YOE_QA.pdf"
  },
  {
    "name": "Divya Prajapati",
    "email_id": "divyaprajapati375@gmail.com",
    "phone_number": "+91 7705956181",
    "location": "Noida - 62, (201301)",
    "objective": "Dedicated and detail-oriented Software Quality Analyst with 3 years of hands-on experience including my six months of internship ensuring the delivery of high-quality software products.",
    "skills": [
      "Regression Testing",
      "Web performance optimization",
      "Black box Testing"
    ],
    "qualifications_summary": "B.TECH(CSE) from Saroj Institutes Of Technology and Management, Lucknow (2018-2022), with a percentage of 78%. Also completed INTER SCHOOL from Seth Anandram Jaipuriya Inter College, Anandnagar (2017-2018) with a percentage of 76%, and HIGH SCHOOL from Inter College, Anandnagar (2015-2016) with a percentage of 85%",
    "experience_summary": "3 years in software quality analysis. At Chawtech Solution Pvt ltd, Noida, worked as Software Quality Analyst from June 2024 to present, conducting comprehensive testing of software applications, including functional, regression, integration, and performance testing. Prepared different types of case studies of the ongoing projects in the company. Previously worked at Hashtags Labs, Lucknow, as Quality Analyst from July 2023 to May 2024, creating test cases and testing applications for websites, supporting junior team members on testing methodologies and tools, and assisting in testing activities including test case preparation, execution, and defect reporting. Also worked at Observance Solutions Pvt LTD, Lucknow, as Trainee Quality Analyst from July 2022 to January 2023, developing and executing comprehensive test plans, test cases, and test scripts, ensuring maximum test coverage.",
    "has_photo": false,
    "id": "ResumeDIVYAPRAJAPATI",
    "_original_filename": "ResumeDIVYAPRAJAPATI.pdf"
  },
  {
    "name": "Piyush Dravyakar",
    "email_id": "piyushdravyakar48@gmail.com",
    "phone_number": "E 8766962378",
    "location": "Noida, India",
    "objective": "Quality Assurance (QA) professional with over 2+ years of experience in Manual and Automation Testing.",
    "skills": [
      "Selenium",
      "Pycharm",
      "Pytest",
      "UI Automation",
      "Jenkins CI/CD",
      "GITHUB CICD",
      "Postman API Testing",
      "Manual Testing",
      "Re-testing",
      "Regression Testing",
      "Smoke Testing",
      "Sanity Testing",
      "JMeter Performance Testing",
      "SQL",
      "GraphQL API",
      "Agile Scrum Methodology",
      "Trello",
      "Slack",
      "BDD Framework Basics",
      "Bug Tracking",
      "STLC",
      "GITLAB",
      "Mobile Testing",
      "Blackbox Testing"
    ],
    "qualifications_summary": "Master In Computer Application, Computer Science (MCA) from Amravati University (2020-2022), Bachelor Of Computer Science (BSC) from Amravati University (2017-2020).",
    "experience_summary": "5+ years in software testing. At Alphabin Technology (06/2024 - Present), collaborated with developers, product managers, and business analysts to clarify requirements and ensure comprehensive testing coverage. Conducted manual API testing to validate functionality, security, and performance. Participated in software release and patch testing cycles. Developed and maintained test artifacts, including test cases, test plans, and defect logs. At Webkul Software (07/2023 – 01/2024), developed test cases and test scripts based on project specifications. Executed manual test cases to identify defects and ensure the functionality meets specified requirements. Logged and tracked defects, providing detailed information to assist developers in resolution. Participated in testing cycles for software releases and patches. Collaborated with cross-functional teams to define test strategies, identify test scenarios, and conduct thorough testing throughout the SDLC. At Cliffex Software Solution (02/2022 - 06/2023), conducted manual testing of software applications, ensuring the reliability and functionality of critical features. Executed automated test scripts and analyzed results. Collaborated with manual testing teams to ensure comprehensive test coverage.",
    "has_photo": true,
    "id": "ResumePIYUSHDRAVYAKAR",
    "_original_filename": "ResumePIYUSHDRAVYAKAR.pdf"
  },
  {
    "name": "Madhav Kumar",
    "email_id": "madhavkumar279_xiu@indeedemail.com",
    "phone_number": "91 8010634173",
    "location": "Gurugram, Haryana",
    "objective": "Results-driven Sr. QA Engineer with 8 years of experience in Manual Testing, Automation Testing (Java & Selenium), SDLC, STLC, and API Testing.",
    "skills": [
      "Agile Scrum practices",
      "API testing using Postman",
      "Functional, integration, and smoke testing",
      "Defect management via JIRA",
      "Cross-browser testing with BrowserStack",
      "Automated tests using TestNG",
      "Project builds with Maven on Mac, Windows, Ubuntu, and Linux",
      "Database querying with SQL"
    ],
    "qualifications_summary": "B. Tech in Information Technology from Hindustan University-Chennai, Tamil Nadu.",
    "experience_summary": "8 years of experience as a Sr. QA Engineer. At Tata Cliq-Gurugram, Haryana (January 2020 to December 2024), developed and implemented automation scripts for regression, smoke, and functional testing, worked on test automation for e-commerce platform, collaborated closely with developers for bug identification and resolution. At Times Internet-Gurugram, Haryana (January 2019 to September 2019), performed API testing using Postman, designed test cases for mobile and web applications, collaborated closely with developers for bug identification and resolution, performed end-to-end manual testing for web and mobile applications across multiple modules. At Appster-Gurugram, Haryana (November 2017 to December 2018), created and executed test cases for functional and regression testing, provided detailed test reports and defect analysis to stakeholders, performed end-to-end manual testing for web and mobile applications across multiple modules, reviewed and analyzed user stories and acceptance criteria for test coverage and clarity. At Goibibo-Gurugram, Haryana (September 2015 to October 2017), conducted manual testing for mobile and web platforms, designed and executed test plans for hotel, flight, and travel booking modules, identified and reported defects, collaborated with the development team for resolutions, performed end-to-end manual testing for web and mobile applications across multiple modules.",
    "has_photo": false,
    "id": "ResumeMadhavKumar",
    "_original_filename": "ResumeMadhavKumar.pdf"
  },
  {
    "name": "Satyam Bansal",
    "email_id": "satyambansal27@gmail.com",
    "phone_number": "+91 7742872370",
    "location": "Gurugram, India",
    "objective": "Experienced Software Testing Engineer / Quality Assurance Engineer with a strong background in manual and automated testing. Seeking to leverage expertise in quality assurance to contribute to high-quality software delivery in South India and Delhi-NCR.",
    "skills": [
      "JIRA",
      "TestRail",
      "Selenium",
      "Appium",
      "Postman",
      "SoapUI",
      "SQL Server",
      "MySQL",
      "Git",
      "Core Python",
      "Core Java",
      "Jenkins",
      "GitLab CI"
    ],
    "qualifications_summary": "B.Tech in Computer Science & Engineering from Global Institute of Technology (2021)",
    "experience_summary": "5 years in software testing. At Codexo Software Pvt. Ltd., spearheaded the development and execution of comprehensive test cases for functional and non-functional requirements, ensuring thorough validation of software features and conducting regression, smoke, and UAT across multiple releases. At Condeco by Eptura, authored and executed functional test cases for web and mobile applications, focusing on end-user functionality, system integration, and cross-browser/device compatibility.",
    "has_photo": true,
    "id": "Satyam Bansal",
    "_original_filename": "Satyam Bansal.pdf"
  },
  {
    "name": "Anmol Sharma",
    "email_id": "anmolsharma47856@gmail.com",
    "phone_number": "91-8077453628",
    "location": "Ghaziabad, Uttar Pradesh",
    "objective": "Detail-oriented Software Tester with 3 years of experience in software quality assurance and manual testing, with a focus on web applications.",
    "skills": [
      "Agile Methodology",
      "Azure Devops",
      "Postman",
      "Microsoft SQL Server",
      "JIRA",
      "SDLC",
      "UAT",
      "STLC",
      "Functional Testing",
      "Smoke Testing",
      "Sanity Testing",
      "Database Testing",
      "System Testing",
      "Regression Testing",
      "API Testing",
      "Cross-browser Testing"
    ],
    "qualifications_summary": "B.Tech (Computer Science) from HR Institute of Technology (08/2016 to 05/2020) and Senior Secondary Education from T.R.M Public School, CBSE Board.",
    "experience_summary": "3 years in software testing. At Xetech Pvt. Ltd (01/2023 to present), participated in Agile methodologies, created test cases, performed manual and functional testing, conducted API and database testing, and reported defects using Azure DevOps. At Cyberlet Technologies Pvt. Ltd (09/2021 to 09/2022), executed manual test cases, participated in daily stand-up meetings, performed functionality testing, retesting, and regression testing.",
    "has_photo": true,
    "id": "ResumeANMOLSHARMA",
    "_original_filename": "ResumeANMOLSHARMA.pdf"
  },
  {
    "name": "Neha Verma",
    "email_id": "verman2612@gmail.com",
    "phone_number": null,
    "location": "Hazaribagh, Jharkhand",
    "objective": "Ready to join a team where I can further develop my skills and contribute effectively to the organization to achieve its objectives.",
    "skills": [
      "PHP",
      "Java",
      "Selenium",
      "Visual Studio",
      "Eclipse",
      "Jira",
      "Upwork",
      "Postman",
      "Excel",
      "Word",
      "PowerPoint",
      "Project"
    ],
    "qualifications_summary": "BCA from Aisect University, Hazaribagh (2018-2021) and a degree in Science (12th) from the same university.",
    "experience_summary": "3 years of experience as a Software Tester. At D Succeed Learners PVT. LTD, Delhi (Jan 2024 - present), performed mobile application testing in Android, executed test cases, and conducted smoke testing, integration testing, system testing, acceptance testing, and regression testing. Previously worked at Flexsin Technologies PVT. LTD, Noida (Nov 2021 - Sep 2022) as a Junior Executive Tester, and Udesha TechWorld Pvt. LTD., Ranchi (Sep 2020 - Oct 2021) as a Software Tester.",
    "has_photo": true,
    "id": "ResumeNehaVerma",
    "_original_filename": "ResumeNehaVerma.pdf"
  },
  {
    "name": "Umang Aggarwal",
    "email_id": "umangaggarwal11223@gmail.com",
    "phone_number": "+91-8267978469",
    "location": "New Delhi, India",
    "objective": "Detail-oriented Software Development Engineer in Test (SDET) with 2+ years of experience in automation and manual testing for web, mobile, and desktop applications.",
    "skills": [
      "Java",
      "HTML",
      "CSS",
      "SQL",
      "Selenium WebDriver",
      "Cucumber",
      "JMeter",
      "Page Object Model (POM)",
      "Behavior Driven Development (BDD)",
      "Rest Assured",
      "Postman",
      "JUnit",
      "TestNG",
      "JIRA",
      "Excel",
      "Word",
      "Git",
      "GitHub",
      "SDLC"
    ],
    "qualifications_summary": "B. Tech in Information Technology from Krishna Engineering College, Ghaziabad, UP (2018-2022) with a percentage of 80.9%. Also completed CBSE Class XII and X from Alpine International School, Shamli, UP.",
    "experience_summary": "5 years of experience in software testing. At Adomantra Digital India Pvt. Ltd., conducted comprehensive testing for mobile and desktop applications, resolved over 200+ bugs through JIRA, and contributed to Agile processes. At Nagarro, developed and executed 200+ automated test scripts using Selenium and Cucumber, conducted manual and automated testing, and participated in Agile development processes. At Infozech Software Pvt. Ltd., maintained organized records of test cases and bug reports, performed manual testing, and partnered with the development and project managers to prioritize and resolve identified issues.",
    "has_photo": true,
    "id": "ResumeUMANGAGGARWAL",
    "_original_filename": "ResumeUMANGAGGARWAL.pdf"
  },
  {
    "name": "Manish Kumar Trivedi",
    "email_id": "manishrahi9031@gmail.com",
    "phone_number": "+91 9942439474",
    "location": null,
    "objective": "To work an organization where can learn new skills and increase my abilities for the organizational goals as well as myself.",
    "skills": [
      "CORE JAVA",
      "Automation Testing",
      "Postman",
      "API-related technologies"
    ],
    "qualifications_summary": "Graduation: Gandhi Engineering college, Bhubaneswar; 12th: AN College, Nabi Nagar Bihar; 10Th: Sita High School, Harihar Ganj, Jharkhand",
    "experience_summary": "1 year at Pantelwar Pvt Ltd, Noida as Software Manual Tester and 1.5 years at Digi Interacts Pvt Ltd, New Delhi as Software Manual Tester. Participated in project Loom 3.7 with marketing automation, performing API testing using postman, functional, integration, system testing, regression testing, and more.",
    "has_photo": false,
    "id": "ResumeManishTrivedi",
    "_original_filename": "ResumeManishTrivedi.pdf"
  },
  {
    "name": "Abhishek Jaiswal",
    "email_id": "aaajais01@gmail.com",
    "phone_number": "+91-8521207528",
    "location": "Noida, India",
    "objective": "Dedicated and detail-oriented QA professional with 2.5+ years of experience and a strong foundation in software testing methodologies, seeking a position as a QA Automation Engineer or Manual Tester.",
    "skills": [
      "Automation Testing",
      "Manual Testing",
      "Test case creation",
      "test execution",
      "bug reporting",
      "JavaScript",
      "TypeScript",
      "Java",
      "SQL",
      "Database",
      "Cypress",
      "Selenium",
      "Playwright",
      "Jira",
      "Postman",
      "RESTful API testing using Postman",
      "Agile/Scrum",
      "Mobile testing for Android and iOS"
    ],
    "qualifications_summary": "Master in Computer Application from Galgotias University (2020-2022) and Bachelor in Computer Application from Galgotias University (2017-2020).",
    "experience_summary": "5+ years of experience in software testing. At Marqd Growth Partners Private Limited (Jul 2024 - Present), responsible for manual testing, including creation and execution of test cases for functionalities like user registration, login, logout, product search, and payment gateway. Implemented various testing phases, ensuring the software's reliability and stability. Tracked and reported bugs using Jira. Crafted and implemented high-impact 300+ Test cases for Web & Mobility testing, leading to a 15% increase in overall testing efficiency and software stability. At Interra IT (Jan 2022 - Sep 2023), executed automated tests to identify software defects. Wrote test cases covering login, logout, file upload, search functionalities, and Business Created. Participated in various testing types, including ad-hoc, smoke, regression, and sanity testing. Contributed to the creation and maintenance of traceability matrices for requirement tracking. Gained hands-on experience with Apache JMeter and Jira.",
    "has_photo": true,
    "id": "ResumeAbhishekJaiswal",
    "_original_filename": "ResumeAbhishekJaiswal.pdf"
  },
  {
    "name": "MAYA AAGALE",
    "email_id": "mayahachion@gmail.com",
    "phone_number": "+91-3986086347/+91-8218198755",
    "location": null,
    "objective": "Aim to work as a Software Test Engineer in Organization Where I can Utilize my 3+ years of experience in the field of Automation Testing using selenium and contribute towards the growth of Organization.",
    "skills": [
      "Java",
      "Selenium",
      "MySQL",
      "Postman",
      "Unix",
      "JIRA",
      "Jenkins",
      "Git",
      "GITHUB",
      "SOAPUI"
    ],
    "qualifications_summary": "Pune University in Computer Engineering, Passing with 7.46 CGPA in 2021; Diploma in Computer Engineering, Passing with 75.88 % in 2018; Passed SSC with 77.78%",
    "experience_summary": "5 years of experience in software testing. At BMC Software India Pvt. Ltd Noida Sector 8 (Sep 2021-Nov 2024), worked as Automation Test Engineer on Lumen West project, a Construction domain project focused on quote management. Responsibilities included understanding and functional requirements, creating test cases using element locators and Selenium WebDriver, participating in test case review meetings, updating of testcases if required, involved in test execution and defect reporting. Also performed database testing using SQL on MySQL Tool and API testing using Postman tool. At Opkey.Pvt.Ltd. Noida Sec 2 (Jan2025-March2025), worked as Automation Test Engineer on Flexible Medsurance project, an Insurance Domain project. Responsibilities included preparing and documenting test conditions and test cases, participating in test case/test script review meetings, performing functionality testing, retesting and regression testing, smoke and sanity testing, interacting with developers and discussed technical problems, bugs tracking and generating report.",
    "has_photo": true,
    "id": "MayaAutomationTester (2)-2",
    "_original_filename": "MayaAutomationTester (2)-2.pdf"
  },
  {
    "name": "Rohit Ranjan",
    "email_id": "rohit.ranjan118@gmail.com",
    "phone_number": "+91-9955614564",
    "location": "Gurugram, India",
    "objective": null,
    "skills": [
      "Manual Testing",
      "Java",
      "Selenium",
      "AzureDevOps",
      "MYSQL",
      "Api Testing",
      "Functional Testing"
    ],
    "qualifications_summary": "B. Tech in Electronics and Communication from G H Raisoni Academy of Engg. & Tech. (2011-2015) with selected trainings at BSNL (2012-2015) and qualified for Silver, Gold & Platinum certification.",
    "experience_summary": "3.4+ years as a software test engineer with experience in manual and automation testing. Worked as QA Engineer at Wipro from 08/2021 to present, developing high-quality test cases, scripts, and results. Performed various types of testing including functional, integration, end-to-end, smoke, sanity, regression, user acceptance, and exploratory testing. Implemented CI/CD pipeline for automated testing using Azure DevOps, leading to a 50% improvement in deployment frequency.",
    "has_photo": true,
    "id": "Rohit Ranjan",
    "_original_filename": "Rohit Ranjan.pdf"
  }
]